kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    switch (status->state) {
    case SID_STATE_READY:
    case SID_STATE_SECURE_CHANNEL_READY:
        sidewalk_state = SIDEWALK_STATE_READY;
        current_led_state = LED_STATE_CONNECTED;
        was_ready_once = true;
        reconnect_request_pending = false;
        LOG_INF("Sidewalk READY — ButterFi online");
        break;

    case SID_STATE_NOT_READY:
        sidewalk_state = SIDEWALK_STATE_INIT;
        current_led_state = LED_STATE_CONNECTING;
        /* Link dropped after being up — flag a beacon connect-request re-arm.
         * Deferred to the main loop: sid_* APIs must not be called from inside
         * this callback, which runs re-entrantly within sid_process(). */
        if (was_ready_once) {
            reconnect_request_pending = true;
        }
        break;

    case SID_STATE_ERROR:
        sidewalk_state = SIDEWALK_STATE_ERROR;
        current_led_state = LED_STATE_ERROR;
        LOG_ERR("Sidewalk ERROR");
        break;
    }

    current_link_state = (status->detail.link_status_mask & SID_LINK_TYPE_1)
        ? BUTTERFI_USB_LINK_BLE
        : BUTTERFI_USB_LINK_UNKNOWN;

    if (status->detail.registration_status == SID_STATUS_NOT_REGISTERED) {
        sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
        current_led_state = LED_STATE_UNPROVISIONED;
        LOG_WRN("Device not registered — missing Sidewalk credential or onboarding");
    }

    refresh_usb_status();
}

static void on_factory_reset(void *context)
{
    LOG_WRN("Factory reset triggered via Sidewalk");
    butterfi_config_clear();
    reset_transfer_state();
    sys_reboot(SYS_REBOOT_COLD);
}

static struct sid_event_callbacks sidewalk_callbacks = {
    .context        = NULL,
    .on_event       = on_sidewalk_event,
    .on_msg_received = on_msg_received,
    .on_msg_sent    = on_msg_sent,
    .on_send_error  = on_send_error,
    .on_status_changed = on_status_changed,
    .on_factory_reset  = on_factory_reset,
};

static int sidewalk_platform_init_once(void)
{
    static bool platform_ready;
    platform_parameters_t platform_parameters = {
        .mfg_store_region = {
            .addr_start = PM_MFG_STORAGE_ADDRESS,
            .addr_end = PM_MFG_STORAGE_END_ADDRESS,
        },
    };
    sid_error_t err;

    if (platform_ready) {
        return 0;
    }

    err = sid_platform_init(&platform_parameters);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_platform_init failed: %d", err);
        return -EFAULT;
    }

    platform_ready = true;
    return 0;
}

static int sidewalk_init(void)
{
    int ret;
    struct sid_end_device_characteristics dev_ch = {
        .type = SID_END_DEVICE_TYPE_STATIC,
        .power_type = SID_END_DEVICE_POWERED_BY_BATTERY_AND_LINE_POWER,
        .qualification_id = 0x0001,
    };

    /* The Sidewalk stack retains the pointer passed to sid_init(), so this
     * config (like the callbacks it references) must live in static storage,
     * not on sidewalk_init()'s stack — otherwise it is a use-after-scope once
     * this function returns, which manifests as the stack silently doing
     * nothing (no crash, no error). Assigned at runtime because
     * app_get_ble_config() is not a constant initializer. */
    static struct sid_config config;

    config.link_mask = SID_LINK_TYPE_1;
    config.dev_ch = dev_ch;
    config.callbacks = &sidewalk_callbacks;
    config.link_config = app_get_ble_config();
    config.sub_ghz_link_config = NULL;
    config.log_config = NULL;
    config.time_sync_config = &default_time_sync_config;

    ret = sidewalk_platform_init_once();
    if (ret < 0) {
        return ret;
    }

    sid_error_t err = sid_init(&config, &sid_handle);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_init failed: %d", err);
        return -EFAULT;
    }

    err = sid_start(sid_handle, SID_LINK_TYPE_1);
    if (err != SID_ERROR_NONE) {
        LOG_ERR("sid_start failed: %d", err);
        return -EFAULT;
    }

    /* Ask the stack to actively establish and hold a BLE gateway connection.
     * Without an auto-connect policy the device only passively accepts brief
     * gateway connections, which drop before time sync / registration can
     * complete — so it never leaves SID_STATUS_NOT_REGISTERED. This mirrors
     * the CONFIG_SID_END_DEVICE_AUTO_CONN_REQ path in the Nordic
     * sid_end_device reference sample. */
    {
        enum sid_link_connection_policy conn_policy =
            SID_LINK_CONNECTION_POLICY_AUTO_CONNECT;
        struct sid_link_auto_connect_params ac_params = {
            .link_type = SID_LINK_TYPE_1,
            .enable = true,
            .priority = 0,
            .connection_attempt_timeout_seconds = 30,
        };

        err = sid_option(sid_handle, SID_OPTION_SET_LINK_CONNECTION_POLICY,
                         &conn_policy, sizeof(conn_policy));
        if (err != SID_ERROR_NONE) {
            LOG_ERR("set connection policy failed: %d", err);
        }

        err = sid_option(sid_handle, SID_OPTION_SET_LINK_POLICY_AUTO_CONNECT_PARAMS,
                         &ac_params, sizeof(ac_params));
        if (err != SID_ERROR_NONE) {
            LOG_ERR("set auto-connect params failed: %d", err);
        }
    }

    LOG_INF("Sidewalk stack started");
    return 0;
}

/* Re-arm the BLE beacon connection request while the device is trying to
 * (re)connect — covers a failed INITIAL connect as well as a post-READY idle
 * drop. Called from the main loop (never a Sidewalk callback). Scoped to
 * SIDEWALK_STATE_INIT (connecting / NOT_READY), so it never fires during
 * registration (NOT_REGISTERED), faults (ERROR), or once connected (READY). The
 * first re-arm is held off until BUTTERFI_INITIAL_CONNECT_GRACE_MS so the
 * auto-connect policy gets its normal initial attempt uncontested; after that it
 * re-issues every BUTTERFI_RECONNECT_REARM_INTERVAL_MS until a gateway answers.
 * A post-READY drop sets reconnect_request_pending for a prompt re-arm. */
static void maybe_rearm_connection_request(void)
{
    int64_t now;
    sid_error_t err;

    if (sid_handle == NULL) {
        return;
    }

    /* Only while connecting (INIT) — not registration issues, faults, or READY. */
    if (sidewalk_state != SIDEWALK_STATE_INIT) {
        return;
    }

