kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
    now = k_uptime_get();
    if (!reconnect_request_pending && now < next_reconnect_arm_ms) {
        return;
    }

    reconnect_request_pending = false;
    next_reconnect_arm_ms = now + BUTTERFI_RECONNECT_REARM_INTERVAL_MS;

    err = sid_ble_bcn_connection_request(sid_handle, true);
    /* ALREADY_EXISTS just means a connection came up in the meantime — benign. */
    if (err == SID_ERROR_NONE || err == SID_ERROR_ALREADY_EXISTS) {
        (void)butterfi_usb_send_debug_text("reconn req armed");
    } else {
        char dbg[48];

        (void)snprintk(dbg, sizeof(dbg), "reconn req err=%d", err);
        (void)butterfi_usb_send_debug_text(dbg);
    }
}
#endif

/* ── LED blink thread ───────────────────────────────────────────────────── */
#define LED_STACK_SIZE 512
#define LED_PRIORITY   7

static void led_thread_fn(void *a, void *b, void *c)
{
    int tick = 0;

    gpio_pin_configure_dt(&led_r, GPIO_OUTPUT_INACTIVE);
    gpio_pin_configure_dt(&led_g, GPIO_OUTPUT_INACTIVE);
    gpio_pin_configure_dt(&led_b, GPIO_OUTPUT_INACTIVE);

    while (1) {
        tick++;

        if (boot_fingerprint_ticks > 0U) {
            boot_fingerprint_ticks--;
            led_set(1, 1, 1);
            k_msleep(250);
            continue;
        }

        if (usb_rx_error_led_ticks > 0U) {
            led_set(1, 1, 0);
            k_msleep(250);
            continue;
        }

        if (usb_rx_byte_led_ticks > 0U) {
            led_set(0, 0, 1);
            k_msleep(250);
            continue;
        }

        if (usb_tx_err_led_ticks > 0U) {
            led_set(1, 0, 1);
            k_msleep(250);
            continue;
        }

        if (usb_tx_ok_led_ticks > 0U) {
            led_set(1, 1, 1);
            k_msleep(250);
            continue;
        }

        if (host_frame_led_ticks > 0U) {
            led_set(0, 1, 1);
            k_msleep(250);
            continue;
        }

        switch (current_led_state) {
        case LED_STATE_BOOT:
            led_set(0, 0, tick % 4 < 2);         /* blue pulse        */
            break;
        case LED_STATE_UNPROVISIONED:
            led_set(tick % 8 < 1, 0, 0);          /* red slow blink    */
            break;
        case LED_STATE_CONNECTING:
            led_set(tick % 4 < 2, tick % 4 < 2, 0); /* yellow blink    */
            break;
        case LED_STATE_CONNECTED:
            led_set(0, 1, 0);                      /* green solid       */
            break;
        case LED_STATE_SENDING:
            led_set(1, 1, 1);                      /* white flash       */
            break;
        case LED_STATE_ERROR:
            led_set(tick % 2, 0, 0);               /* red fast blink    */
            break;
        }
        k_msleep(250);
    }
}

K_THREAD_DEFINE(led_tid, LED_STACK_SIZE,
                led_thread_fn, NULL, NULL, NULL,
                LED_PRIORITY, 0, 0);

/* ── USB service thread ─────────────────────────────────────────────────── */
/* This thread now only emits the 1 Hz status + boot-info frames — it no longer
 * polls or handles host frames (the main thread is the sole poller). Its peak
 * is one send_frame (~519B frame buffer) + call overhead, so 1024 is ample.
 * The big config-save/query buffers that once overflowed 1024 here now live on
 * the main thread's stack instead (CONFIG_MAIN_STACK_SIZE, bumped to 8192).
 * THREAD_ANALYZER reports the real high-water marks within 30s of boot. */
#define USB_STACK_SIZE 1024
#define USB_PRIORITY   -1

static void usb_thread_fn(void *a, void *b, void *c)
{
    int64_t next_usb_status_ms = 0;

    ARG_UNUSED(a);
    ARG_UNUSED(b);
    ARG_UNUSED(c);

    while (1) {
        /* NOTE: this thread does NOT call butterfi_usb_poll(). RX parsing and
         * host-frame handling run only on the main thread (see the Sidewalk
         * loop / run_usb_control_loop), so there is a single owner of the RX
         * ring and parser state — and so host frames that issue Sidewalk API
         * calls run in the same context as sid_process(). This thread only
         * emits periodic TX (serialized by tx_mutex in butterfi_usb.c). */
        if (usb_ready && k_uptime_get() >= next_usb_status_ms) {
            (void)butterfi_usb_send_status();
            /* Emit the boot summary only for the first ~20s so a watcher that
             * attaches shortly after boot still catches it, without flooding
             * the debug channel during later protocol tests. */
            if (boot_info[0] != '\0' && boot_info_emits_remaining > 0) {
                (void)butterfi_usb_send_debug_text(boot_info);
                boot_info_emits_remaining--;
            }
            next_usb_status_ms = k_uptime_get() + 1000;
        }

        k_msleep(20);
    }
}

K_THREAD_DEFINE(usb_tid, USB_STACK_SIZE,
                usb_thread_fn, NULL, NULL, NULL,
                USB_PRIORITY, 0, 0);

static void run_usb_control_loop(void)
{
    while (1) {
        if (usb_ready) {
            butterfi_usb_poll();
            poll_usb_diag_counters();
        }

        k_msleep(50);
    }
}

/* ── Main ───────────────────────────────────────────────────────────────── */
int main(void)
{
    int ret;

    LOG_INF("ButterFi v%s starting", BUTTERFI_VERSION);

    /* Load config from NVS — school ID, content package, etc. */
    ret = butterfi_config_load();
    if (ret < 0) {
        LOG_WRN("No config found — device needs provisioning");
        current_led_state = LED_STATE_UNPROVISIONED;
    } else {
        LOG_INF("Config loaded: school=%s pkg=%s",
                butterfi_config_get_school_id(),
                butterfi_config_get_content_pkg());
    }

    /* USB CDC-ACM for provisioning tool comms */
    ret = butterfi_usb_init(handle_host_frame, NULL);
    if (ret < 0) {
        LOG_ERR("USB init failed: %d", ret);
    } else {
        usb_ready = true;
        refresh_usb_status();
    }

#if BUTTERFI_INCLUDE_SIDEWALK
    /* One-time maintenance: earlier firmware mounted butterfi_config's NVS on
     * the DTS storage_partition, which physically overlaps settings_storage
     * (where the Sidewalk stack persists its registration/time-sync key
     * store). That left a foreign NVS filesystem inside settings_storage that
     * the Sidewalk NVS still mounts and reads as stale/garbage state. Wipe it
     * once — before sidewalk_init() so Sidewalk mounts a clean store — then
     * never again. Runs pre-radio, so no flash/radio contention here.
     *
     * Fail closed: record the new generation FIRST and verify it stuck; only
     * then wipe. A wipe we cannot record is a wipe we must not perform — the
     * alternative is a unit that silently erases the Sidewalk key store on
     * every boot and can never register. */
    {
        uint32_t maint_gen = 0;

        if (butterfi_config_get_maint_gen(&maint_gen) == 0 &&
            maint_gen < BUTTERFI_SETTINGS_MAINT_GEN) {
            uint32_t check = 0;

            if (butterfi_config_set_maint_gen(BUTTERFI_SETTINGS_MAINT_GEN) == 0 &&
                butterfi_config_get_maint_gen(&check) == 0 &&
                check == BUTTERFI_SETTINGS_MAINT_GEN) {
                const struct flash_area *fa;

                if (flash_area_open(PM_SETTINGS_STORAGE_ID, &fa) == 0) {
                    int erase_ret = flash_area_erase(fa, 0, fa->fa_size);

