kevinl95/ButterFi/firmware/xiao_nrf52840/src/main.c
                    flash_area_close(fa);
                    LOG_WRN("Wiped stale settings_storage (gen %u->%u): %d",
                            maint_gen, BUTTERFI_SETTINGS_MAINT_GEN, erase_ret);
                }
            } else {
                LOG_ERR("Skipping settings_storage wipe: cannot persist marker");
            }
        }
    }
#endif

    /* Capture LFCLK source + build flags + the maintenance generation for the
     * 0x87 boot summary. Done AFTER the wipe so gen reflects the persisted
     * marker — if it ever reads back 0 on a later boot, the marker is not
     * sticking (the fail-open wipe hazard). */
    populate_boot_info();

#if BUTTERFI_USB_CONTROL_DEBUG
    LOG_WRN("USB control debug build active - Sidewalk startup skipped");
    sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
    current_led_state = LED_STATE_UNPROVISIONED;
    refresh_usb_status();

    run_usb_control_loop();
#elif BUTTERFI_INCLUDE_SIDEWALK
    /* Sidewalk stack */
    ret = sidewalk_init();
    if (ret < 0) {
        current_led_state = LED_STATE_ERROR;
        refresh_usb_status();
        LOG_ERR("Sidewalk init failed — halting");
        return ret;
    }

    current_led_state = LED_STATE_CONNECTING;
    refresh_usb_status();

    /* Main event loop — Sidewalk is event-driven */
    while (1) {
        if (usb_ready) {
            butterfi_usb_poll();
            poll_usb_diag_counters();
        }

        (void)k_sem_take(&sidewalk_event_sem, K_MSEC(100));

        if (sid_handle != NULL) {
            sid_error_t err = sid_process(sid_handle);
            if (err != SID_ERROR_NONE) {
                LOG_ERR("sid_process error: %d", err);
            }
        }

        maybe_rearm_connection_request();
    }
#else
    LOG_WRN("Sidewalk excluded from build");
    sidewalk_state = SIDEWALK_STATE_NOT_REGISTERED;
    current_led_state = LED_STATE_UNPROVISIONED;
    refresh_usb_status();
    run_usb_control_loop();
#endif

    return 0;
}
